//
// Created by maicaoboy on 2023/12/4.
//
//
#include "stdio.h"
#include "stdlib.h"
#include "string.h"

/**
 * 1.求N至少是多大时，由N个1组成整数能被 1221 整除
 */
int divide() {
    int num = 1221;
    int k = 1;
    int N = 1;
    while(N <= 10) {        //防止溢出
        if(k % num == 0) {
            return N;
        }
        k = k * 10 + 1;
        N++;
    }
    return -1;          //-1代表不存在
}


/**
 * 2.从键盘输入 500 个整数，存入数组 500中，输出该数组中相差最小的两个元素差
 */
#define INF 999999999
int minus() {
    int a[500];
    int min = INF;
    int pre = INF;
    for(int i = 0; i < 500; i++) {
        scanf("%d", &a[i]);
        if(a[i] < min) {        //记录最小的两个数
            pre = min;
            min = a[i];
        }
    }
    return pre - min;
}

#define N 57
struct score {
    char sports[1001];      //运动项目名称
    int athlete[8];         //运动员编号
    char college[50];       //学院名称
    int place;              //名次
    float result;           //成绩
};
void swap(struct score *a, struct score *b) {
    struct score c = *a;
    *a = *b;
    *b = c;
}
void total(struct score record[N]) {
    //两次冒泡排序,运用基数排序思想是的数组按运动项目-成绩有序排列,之后遍历每一项运动的前六个即为所求
    for(int i = 0; i < N; i++) {            //按成绩排序
        for (int j = 1; j < N - i; ++j) {
            if(record[j - 1].place > record[j].place) {
                swap(&record[j - 1], &record[j]);
            }
        }
    }

    for(int i = 0; i < N; i++) {            //按运动名称排序
        for (int j = 1; j < N - i; ++j) {
            if(strcmp(record[j - 1].sports, record[j].sports) > 0) {
                swap(&record[j - 1], &record[j]);
            }
        }
    }

    //找出每项运动前六的成绩
    int slow = 0, fast = 0, pre = 0;
    while(slow != N) {
        while(strcmp(record[pre].sports, record[fast].sports) == 0) {
            pre = fast;
            fast++;
        }
        printf("项目1:%s的前六名为:\n", record[slow].sports);
        for(int i = slow; i < fast && i < slow + 6; i++) {
            printf("运动员编号:");
            for (int j = 0; j < 8; ++j) {
                printf("%d", record[i].athlete[j]);
            }
            printf(",名次:%d, 成绩:%f\n", record[i].place, record[i].result);
        }
        slow = fast;
        pre = fast;
    }

}







int main() {
    int k1 = divide();
    printf("%d\n", k1);

//    int k2 = minus();
//    printf("%d\n", k2);

    //测试total函数
    struct score record[N] = {
            {"跑步",{0,0,0,0,0,0,0,1},"计算机学院",1,10.0f},
            {"跑步",{0,0,0,0,0,0,0,2},"计算机学院",2,9.0f},
            {"跑步",{0,0,0,0,0,0,0,3},"计算机学院",3,8.0f},
            {"跑步",{0,0,0,0,0,0,0,4},"计算机学院",4,7.0f},
            {"跑步",{0,0,0,0,0,0,0,5},"计算机学院",5,6.0f},
            {"跑步",{0,0,0,0,0,0,0,6},"计算机学院",6,5.0f},
            {"跑步",{0,0,0,0,0,0,0,7},"计算机学院",7,4.0f},
            {"跑步",{0,0,0,0,0,0,0,8},"计算机学院",8,3.0f},
            {"跳高",{0,0,0,0,0,0,0,9},"计算机学院",1,10.0f},
            {"跳高",{0,0,0,0,0,0,1,0},"计算机学院",2,9.0f},
            {"跳高",{0,0,0,0,0,0,1,1},"计算机学院",3,8.0f},
            {"跳高",{0,0,0,0,0,0,1,2},"计算机学院",4,7.0f},
            {"跳高",{0,0,0,0,0,0,1,3},"计算机学院",5,6.0f},
            {"跳高",{0,0,0,0,0,0,1,4},"计算机学院",6,5.0f},
            {"跳高",{0,0,0,0,0,0,1,5},"计算机学院",7,4.0f},
            {"跳高",{0,0,0,0,0,0,1,6},"计算机学院",8,3.0f},
            {"跳高",{0,0,0,0,0,0,1,7},"计算机学院",9,2.0f},
            {"跳高",{0,0,0,0,0,0,1,8},"计算机学院",10,1.0f},
            {"跳高",{0,0,0,0,0,0,1,9},"计算机学院",11,0.0f},
            {"跳高",{0,0,0,0,0,0,2,0},"计算机学院",12,0.0f},
            {"跳高",{0,0,0,0,0,0,2,1},"计算机学院",13,0.0f},
            {"跳高",{0,0,0,0,0,0,2,2},"计算机学院",14,0.0f},
            {"跳高",{0,0,0,0,0,0,2,3},"计算机学院",15,0.0f},
            {"跳高",{0,0,0,0,0,0,2,4},"计算机学院",16,0.0f},
            {"跳高",{0,0,0,0,0,0,2,5},"软件学院",17,0.0f},
            {"跳高",{0,0,0,0,0,0,2,6},"软件学院",18,0.0f},
            {"跳高",{0,0,0,0,0,0,2,7},"软件学院",19,0.0f},
            {"跳高",{0,0,0,0,0,0,2,8},"软件学院",20,0.0f},
            {"跳高",{0,0,0,0,0,0,2,9},"软件学院",21,0.0f},
            {"跳高",{0,0,0,0,0,0,3,0},"软件学院",22,0.0f},
            {"跳高",{0,0,0,0,0,0,3,1},"软件学院",23,0.0f},
            {"跳高",{0,0,0,0,0,0,3,2},"软件学院",24,0.0f},
            {"跳高",{0,0,0,0,0,0,3,3},"软件学院",25,0.0f},
            {"跳高",{0,0,0,0,0,0,3,4},"软件学院",26,0.0f},
            {"跳高",{0,0,0,0,0,0,3,5},"软件学院",27,0.0f},
            {"跳高",{0,0,0,0,0,0,3,6},"软件学院",28,0.0f},
            {"跳高",{0,0,0,0,0,0,3,7},"软件学院",29,0.0f},
            {"跳高",{0,0,0,0,0,0,3,8},"软件学院",30,0.0f},
            {"跳高",{0,0,0,0,0,0,3,9},"软件学院",31,0.0f},
            {"游泳",{0,0,0,0,0,0,4,0},"软件学院",5,100},
            {"游泳",{0,0,0,0,0,0,4,1},"软件学院",6,99},
            {"游泳",{0,0,0,0,0,0,4,2},"软件学院",7,98},
            {"游泳",{0,0,0,0,0,0,4,3},"软件学院",8,97},
            {"游泳",{0,0,0,0,0,0,4,4},"软件学院",9,96},
            {"游泳",{0,0,0,0,0,0,4,5},"软件学院",10,95},
            {"游泳",{0,0,0,0,0,0,4,6},"软件学院",11,94},
            {"游泳",{0,0,0,0,0,0,4,7},"软件学院",12,93},
            {"游泳",{0,0,0,0,0,0,4,8},"软件学院",13,92},
            {"游泳",{0,0,0,0,0,0,4,9},"软件学院",14,91},
            {"游泳",{0,0,0,0,0,0,5,0},"软件学院",15,90},
            {"游泳",{0,0,0,0,0,0,5,1},"软件学院",16,89},
            {"游泳",{0,0,0,0,0,0,5,2},"软件学院",17,88},
            {"游泳",{0,0,0,0,0,0,5,3},"软件学院",18,87},
            {"游泳",{0,0,0,0,0,0,5,4},"软件学院",19,86},
            {"游泳",{0,0,0,0,0,0,5,5},"软件学院",20,85},
            {"游泳",{0,0,0,0,0,0,5,6},"软件学院",21,84},
            {"游泳",{0,0,0,0,0,0,5,7},"软件学院",22,83}
    };
    total(record);

}
